import React, { useEffect, useState } from 'react';
import Navbar from './Navbar';
import './App.css';

const Index = () => {

    return (
        <div>
            <Navbar />
            <div className="table-container">
                <div className="table">
                    <div className="content">
                        <table>
                            <tr className='thead'>
                                <th>Қўмита марказий аппарат масъул ижрочиси</th>
                                <th>Президент ҳужжатлари</th>
                                <th>Вазирлар Маҳкамаси хужжатлари</th>
                                <th>Вазирлик ва идоралар келиб тушган хужжатлар</th>
                                <th>Жисмоний ва юридик шахслардан келиб тушган мурожаатлар</th>
                            </tr>
                            
                            {[
                                'Молия - иқтисодиёт бошқармаси',
                                'Ҳудудий йўлларни таъмирлаш ва ривожлантириш дастурларини амалга ошириш мониторинги бошқармаси',
                                'Автомобиль йўлларидан фойдаланиш ва техник ҳолатини таҳлил қилиш бошқармаси',
                                'Автомобиль йўлларида қурилиш ишларини ташкил этиш бошқармаси',
                                'Саноатни ривожлантириш ва йўл техникаларидан фойдаланиш бошқармаси',
                                'Истиқболни белгилаш ва йиғма-таҳлил бошқармаси',
                                'Хорижий инвестициялар ва давлат-хусусий шерикчиликни ривожлантириш бошқармаси',
                                'Инновациялар ва лойиҳалаштириш ишлари мониторинги бўлими',
                                'Инсон ресурсларини ривожлантириш ва бошқариш бўлими',
                                'Бухгалтерия ҳисоби ва ҳисоботи бўлими',
                                'Юридик ва ички назорат хизмати'
                            ].map((item, index) => (
                                <tr key={index}>
                                    <th>{item}</th>
                                    <td>3</td>
                                    <td>3</td>
                                    <td>3</td>
                                    <td>3</td>
                                </tr>
                            ))}
                        </table>
                    </div>
                </div>
            </div>
        </div>
    );
};

export default Index;

